<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Ministry;

class MinistriesSeeder extends Seeder
{
    public function run()
    {
        $ministries = [
            'Иқтисодиёт ва молия вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Божхона қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Давлат захираларини бошқариш қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Ғазначилик хизмати қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Кадастр агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Давлат асиллик даражаси назорати инспекцияси' => ['шу жумладан, бошлиқ ўринбосарлари сони'],
            ],
            'Инвестициялар, саноат ва савдо вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Хорижий инвестицияларни жалб этиш агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
            ],
            'Камбағалликни қисқартириш ва бандлик вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
            ],
            'Қишлоқ хўжалиги вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Ветеринария ва чорвачиликни ривожлантириш қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Ипакчилик ва жун саноатини ривожлантириш қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Ўсимликлар карантини ва ҳимояси агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Агросаноатни ривожлантириш агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
            ],
            'Сув хўжалиги вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Сув хўжалиги объектларини эксплуатация қилиш агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Сув хўжалиги объектлари хавфсизлигини ва сувдан фойдаланишни назорат қилиш инспекцияси' => ['шу жумладан, бошлиқ ўринбосарлари сони'],
            ],
            'Қурилиш ва уй-жой коммунал хўжалиги вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Қурилиш ва уй-жой коммунал хўжалиги соҳасида назорат қилиш инспекцияси' => ['шу жумладан, бошлиқ ўринбосарлари сони'],
            ],
            'Транспорт вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Автомобиль йўллари қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Фуқаро авиацияси агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Транспорт назорати инспекцияси' => ['шу жумладан, бошлиқ ўринбосарлари сони'],
            ],
            'Энергетика вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
            ],
            'Тоғ-кон саноати ва геология вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Тоғ-кон саноати ва геология соҳасини назорат қилиш инспекцияси' => ['шу жумладан, бошлиқ ўринбосарлари сони'],
            ],
            'Рақамли технологиялар вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Космик тадқиқотлар ва технологиялар агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Ахборотлаштириш ва телекоммуникациялар соҳасида назорат инспекцияси' => ['шу жумладан, бошлиқ ўринбосарлари сони'],
            ],
            'Экология, атроф-муҳитни муҳофаза қилиш ва иқлим ўзгариши вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Туризм қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Ўрмон хўжалиги агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Гидрометеорология хизмати агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Чиқиндиларни бошқариш ва циркуляр иқтисодиётни ривожлантириш агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
            ],
            'Соғлиқни сақлаш вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Санитария-эпидемиологик осойишталик ва жамоат саломатлиги қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Фармацевтика тармоғини ривожлантириш агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
            ],
            'Мактабгача ва мактаб таълими вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Ихтисослаштирилган таълим муассасалари агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
            ],
            'Олий таълим, фан ва инновациялар вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Инновацион ривожланиш агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Билим ва малакаларни баҳолаш агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
            ],
            'Спорт вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
            ],
            'Маданият вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                'Миллатлараро муносабатлар ва хорижий мамлакатлар билан дўстлик алоқалари қўмитаси' => ['шу жумладан, раис ўринбосарлари сони'],
                'Кинематография агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
            ],
            'Адлия вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
                '«Ўзархив» агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
                'Персоналлаштириш агентлиги' => ['шу жумладан, директор ўринбосарлари сони'],
            ],
            'Ташқи ишлар вазирлиги' => [
                'шу жумладан, вазир ўринбосарлари сони',
            ],
            // 'Рақобатни ривожлантириш ва истеъмолчилар ҳуқуқларини ҳимоя қилиш қўмитаси' => [
            //     'шу жумладан, раис ўринбосарлари сони',
            // ],
            // 'Дин ишлари бўйича қўмита' => [
            //     'шу жумладан, раис ўринбосарлари сони',
            // ],
            // 'Давлат активларини бошқариш агентлиги' => [
            //     'шу жумладан, директор ўринбосарлари сони',
            // ],
            // 'Миллий антидопинг агентлиги' => [
            //     'шу жумладан, директор ўринбосарлари сони',
            // ],
            // 'Маданий мерос агентлиги' => [
            //     'шу жумладан, директор ўринбосарлари сони',
            // ],
            // 'Ёшлар ишлари агентлиги' => [
            //     'шу жумладан, директор ўринбосарлари сони',
            // ],
            // 'Ўзбекистон техник жиҳатдан тартибга солиш агентлиги' => [
            //     'шу жумладан, директор ўринбосарлари сони',
            // ],
            // 'Техник жиҳатдан тартибга солиш соҳасида назорат инспекцияси' => [
            //     'шу жумладан, бошлиқ ўринбосарлари сони',
            // ],
            // 'Саноат, радиация ва ядро хавфсизлиги қўмитаси' => [
            //     'шу жумладан, раис ўринбосарлари сони',
            // ],
            // 'Атом энергияси агентлиги' => [
            //     'шу жумладан, директор ўринбосарлари сони',
            // ],
            // 'Энергетика бозорини ривожлантириш ва тартибга солиш агентлиги' => [
            //     'шу жумладан, директор ўринбосарлари сони',
            // ],
            // 'Электр энергияси, нефть маҳсулотлари ва газдан фойдаланишни назорат қилиш инспекцияси' => [
            //     'шу жумладан, бошлиқ ўринбосарлари сони',
            // ],
            // 'Оила ва хотин-қизлар қўмитаси' => [
            //     'шу жумладан, раис ўринбосарлари сони',
            // ],
            // 'Миграция агентлиги' => [
            //     'шу жумладан, директор ўринбосарлари сони',
            // ],
            // 'Агросаноат мажмуи устидан назорат қилиш инспекцияси' => [
            //     'шу жумладан, бошлиқ ўринбосарлари сони',
            // ],
            // 'Солиқ қўмитаси' => [
            //     'шу жумладан, раис ўринбосарлари сони',
            // ],
        ];

        $this->seedMinistries($ministries);
    }

    private function seedMinistries(array $ministries, $parentId = null)
    {
        foreach ($ministries as $key => $value) {
            if (is_array($value)) {
                $ministry = Ministry::create(['name' => $key, 'parent_id' => $parentId]);

                $this->seedMinistries($value, $ministry->id);
            } else {
                Ministry::create(['name' => $value, 'parent_id' => $parentId]);
            }
        }
    }
}
